class OnboardingViewModel {
  final List<Map<String, String>> pages = [
    {
      'title': 'قم بتمكين تجربة التعلم الخاصة بك',
      'desc': 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة. لقد تم توليد هذا النص من مولد النص العربي.'
    },
    {
      'title': 'قم بتمكين تجربة التعلم الخاصة بك',
      'desc': 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة. لقد تم توليد هذا النص من مولد النص العربي.'
    },
    {
      'title': 'قم بتمكين تجربة التعلم الخاصة بك',
      'desc': 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة. لقد تم توليد هذا النص من مولد النص العربي.'
    },
  ];
}
